current_index = 0;
dialog = [
	/*"（鞋带最好……呀，鞋带不就是用来开掉的嘛）",
	"（事物就是为了它的毁灭才生成的啊，熵增才是一切的命运）",
	"（话说熵是……）"									 ,
	"（记得克劳修斯好像）"							  ,
	"（啊Q/T对）"									  ,
	"（不太直观）"									 ,
	"（玻尔兹曼，更好是Boltzmann对对对对S=klnΩ）"		  ,
	"（k就是Boltzmann常数嗯嗯Ω是可能的状态数）"		  ,
	"（如果一堆围棋子一半是白的一半是黑的，和全是）"	 ,
	"（黑的或白的，比起来哪个更，混乱？）"				  ,
	"（应该一半一半，Sigma Pi ln Pi咦负数）"			  ,
	"（那就全都要变成铁咯？我明白了）",
	"山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。",
	"苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。",
	"无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？ ",*/
	"人活着哪有不疯的？硬撑罢了！人活着哪有不疯的？硬撑罢了！人活着哪有不疯的？硬撑罢了！妈的，忍不了，一拳把地球打爆！",
	"妈的，忍不了，一拳把地球打爆！妈的，忍不了，拳把地球打爆！",
	"好可怕杀杀杀杀杀杀上勾拳！下勾拳！左勾拳！右勾拳！扫堂腿！回旋踢！这是蜘蛛吃耳屎，这是龙卷风摧毁停车场！",
	"这是羚羊蹬，这是山羊跳！乌鸦坐飞机！老鼠走迷宫！大象踢腿！愤怒的章鱼！巨斧砍大树！彻底疯狂！彻底疯狂！",
	"彻底疯狂！彻底疯狂！彻底疯狂！彻底疯狂！彻底疯狂！杀！杀！杀！杀！杀！杀！杀！杀！杀！杀！杀！杀！",
	"。。。。。。吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼",
];

textbar.set_text(dialog[current_index]);